/*
Да се напише програма която позволява интерактивно създаване на сцена,
съдържаща произволен брой елипси, задавани с посочването на 3 точки с
ляв бутон на мишката – център, радиус по X и по Y и отсечки, определени
по начална и крайна точка, задавани с ляв бутон на мишката. Да се
реализира операция изтриване на обект (с десен бутон на мишката или
комбинация Ctrl+ляв бутон в близост до 3 пиксела около линия на обекта).
Получената сцена да се съхранява и чете от файл. File/New да изчиства
създаденото изображение, като предложи съхраняване, ако такова не е
извършено.
*/